

# Потоки ввода и вывода (input/print)

# Поток вывода
#print(100) 

# ' ' / " "  - Указывают на текст
#print("vanya")

#Поток ввода данных
#input("Enter your name: ")
#print("end")

################################################

# Переменная - cсылка на ячейку памяти в оперативке

# = - Знак присвоения

#city = input("Enter your city: ")
#print("My city", city, ":)")

"""
Запросить в консоли имя
Запросить в консоли возраст
Вывести текст следующего содержания:
<<Имя>> , тебе уже <<возраст>>
"""

"""
name = input("Enter you name:")
age = input("Enter you age:")
print(name, "you have", age)
"""


"""
Запросить у пользователя имя
Запросить у пользователя город
Вывести в консоль
<<имя>>, я тоже живу в городе <<город>> 
"""


"""
name = input("Enter you name:")
city = input("Enter you city:")
print(name,"я тоже живу в городе", city )
"""


###########################################################

# Математические операции и типы данных

# мат операции стандарт: +, -, /, // , *, **, %,

#res = 10*2
#print(res)

#print(5+2)
#print(5-2)
#print(5/2)
#print(5//2) #Целочисленное деление
#print(5*2)
#print(5**2)


#print(5%2) # 5 - 4 = 1
#print(9%3) # 9 - 9 = 0
#print(15%4) # 15 - 12 = 3

#num1 = 4
#num2 = 8
#res = num1 - num2
#print(res)


"""

Запросить у пользователя сначало одно число
Запросить у пользователя потом другое число
Вывести в консоль следующий текст:
<<Первое число>> + <<второе число>> = <<Результат>>

"""


"""
int - Целые числа, float - Дробные числа  (number)
str - Cтроки
"""

# ДРОБНЫЕ ЧИСЛА ПИШУТСЯ ЧЕРЕЗ ТОЧКУ

#print(2+2.5)
#print('2'+'2')

# Любые данные которые приходят извне в код, обычно являются строками
# type() - Позволяет проверять тип данных

#print(type('4'))
#print(type(4))
#print(type(2.5))

#Преобразование типов данных

#num = '4'
#num = int(num)
#print(type(num))

"""
str 4.5 может преобразоваться в флоат. Но не может в инт
str 4 может преобразоваться и в инт и флоат
"""

"""
num = input("Enter num")
num = float(num)
print(num)
print(num + 4)
print(type(num))
"""


#num1 = float(input("Pleas enter you first number:")) #v3
#num2 = float(input("Pleas enter you second number: "))

#num1 = float(num1) v1
#num2 = float(num2)
#res = float(num1) + float(num2) v2

#res = num1 + num2
#print(num1, '+', num2, '=', res)


############################################################################

#num = 4
#num = num + 1

#print(num) #5


"""
Запросить у пользователя целое число
И увеличить его значения на 30
После чего вывести его значение
"""


"""
num = int(input("Enter you number:"))
num += 30  #num = num + 30
print(num)
"""

#num = 5
#num **= 2 #num = num ** 2
#num /= 3 #num = num / 3


# Глава 2.  Первые 6 ссылок


























